class AppConstants {
  static const nationality = [
    'বাংলাদেশী',
  ];
  static const List<String> bioDataType = [
    'পাত্রের বায়োডাটা',
    'পাত্রীর বায়োডাটা'
  ];
  static const List<String> maritialStatus = [
    'অবিবাহিত',
    'বিবাহিত',
    'ডিভোর্সড',
    'বিধবা',
    'বিপত্নীক',
  ];
  static const List<String> bodyColor = [
    'কালো',
    'শ্যামলা',
    'উজ্জ্বল শ্যামলা',
    'ফর্সা',
    'উজ্জ্বল ফর্সা',
  ];
  static const List<String> weight = [
    '৩০ কেজির কম',
    '8০ কেজি',
    '৫০ কেজি',
    '৬০ কেজি',
    '৭০ কেজি',
    '৮০ কেজি',
    '৯০ কেজি',
    '১০০ কেজি',
  ];
  static const List<String> bloodGroup = [
    'A+',
    'B+',
    'AB+',
    'AB-',
    'A-',
    'B-',
    'O+',
    'O-',
    'জানা নেই',
  ];
  static const List<String> height = [
    '৪ ফুটের কম',
    '8\'',
    '8\'১"',
    '8\'২"',
    '8\'৩"',
    '8\'8"',
    '8\'৫"',
    '8\'৬"',
    '8\'৭"',
    '8\'৮"',
    '8\'৯"',
    '8\'১০"',
    '8\'১১"',
    '৫\'',
    '৫\'১"',
    '৫\'২"',
    '৫\'৩"',
    '৫\'8"',
    '৫\'৫"',
    '৫\'৬"',
    '৫\'৭"',
    '৫\'৮"',
    '৫\'৯"',
    '৫\'১০"',
    '৫\'১১"',
  ];
  static const List<String> educationType = ['জেনারেল', 'কওমি', 'আলিয়া'];
  static const List<String> generalEduHstDgr = [
    'এস.এস.সি\'র নিচে',
    'এস.এস.সি',
    'এইচ.এস.সি',
    'ডিপ্লোমা চলমান',
    'ডিপ্লোমা',
    'স্নাতক চলমান',
    'স্নাতক',
    'স্নাতকোত্তর',
    'ডক্টরেট'
  ];
  static const List<String> educationDept = [
    'বিজ্ঞান বিভাগ',
    'ব্যবসা বিভাগ',
    'মানবিক বিভাগ',
    'ভোকেশনাল'
  ];
  static const List<String> sscResult = [
    'Golden A+',
    'A+',
    'A',
    'A-',
    'B',
    'C',
    'D'
  ];
  static const economicStatus = [
    'উচ্চবিত্ত',
    'উচ্চ মধ্যবিত্ত',
    'মধ্যবিত্ত',
    'নিম্ন মধ্যবিত্ত',
    'নিম্নবিত্ত'
  ];
  static const fiqh = [
    'আহলে হাদীস / সালাফি',
    'হানাফি',
    'মালিকি',
    'শাফিঈ',
    'হাম্বলি'
  ];
  static const prefessions = [
    'ইমাম',
    'মাদ্রাসা শিক্ষক',
    'শিক্ষক',
    'ডাক্তার',
    'ইঞ্জিনিয়ার',
    'ব্যবসায়ী',
    'সরকারী চাকুরী',
    'বেসরকারী চাকুরী',
    'ফ্রিল্যান্সার',
    'শিক্ষার্থী',
    'প্রবাসী',
    'অন্যান্য',
    'পেশা নেই'
  ];
  static const divison = [
    'চট্টগ্রাম',
    'রাজশাহী',
    'খুলনা',
    'বরিশাল',
    'সিলেট',
    'ঢাকা',
    'রংপুর',
    'ময়মনসিংহ',
    'ফরিদপুর'
  ];
}
